In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
sozlukVerisi = {"istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
havaDurumuDataFrame.dropna()
# NaN olan değerleri düşürür.
# fakat NaN olan satırı da silmiş olur.

   istanbul  Ankara  Izmır
0      30.0    20.0     40

In [10]:
havaDurumuDataFrame

   istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [12]:
havaDurumuDataFrame.dropna(axis = 1)
# NaN olmayan kolon hariç diğerlerini siler.

   Izmır
0     40
1     39
2     38

In [15]:
yeniVeri = {"istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [16]:
yeniDataFrame

   istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [18]:
yeniDataFrame.dropna(axis = 1, thresh = 2)
# kolonları baz alarak, 2 ve üstü NaN olan kolonları düşürür.

   istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [19]:
yeniDataFrame

   istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
yeniDataFrame.fillna(20)
# NaN değerleri yerine istediğin değeri girer.

   istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0